base/DataProcessors/ЭлектронноеАктированиеЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭлектронноеАктированиеЕИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

base/InformationRegisters/ДанныеДокументовЭлектронногоАктированияЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДокументовЭлектронногоАктированияЕИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапИсполненияКонтракта</Name>
					<Comment>GUID этапа контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйКонтрактЕИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГосударственныеКонтрактыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаОбжалованияОтказаОПриемке</Name>
					<Comment>Вид документа, подтверждающего наличие соглашения сторон или решения суда по обжалованию отказа в приемке ТРУ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовОбжалованияОтказаОПриемке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыДокументаОбжалованияОтказаОПриемке</Name>
					<Comment>Реквизиты документа, подтверждающего наличие соглашения сторон или решения суда по обжалованию отказа в приемке ТРУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЭлектронныхДокументовЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/DataProcessors/ЭлектронноеАктированиеЕИС/Forms/ФормаДанныхОбжалованияОтказаОПриемке/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Документ = Параметры.Документ;
	ВидДокументаОбжалованияОтказаОПриемке = Параметры.ВидДокументаОбжалованияОтказаОПриемке;
	РеквизитыДокументаОбжалованияОтказаОПриемке = Параметры.РеквизитыДокументаОбжалованияОтказаОПриемке;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВидДокументаОбжалованияОтказаОПриемке", ВидДокументаОбжалованияОтказаОПриемке);
	СтруктураВозврата.Вставить("РеквизитыДокументаОбжалованияОтказаОПриемке", РеквизитыДокументаОбжалованияОтказаОПриемке);
	
	ЗаписатьДанныеПоДокументуНаСервере();
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанныеПоДокументуНаСервере()

	НаборДанныеДокумента = РегистрыСведений.ДанныеДокументовЭлектронногоАктированияЕИС.СоздатьНаборЗаписей();
	НаборДанныеДокумента.Отбор.Документ.Установить(Документ);
	
	НаборДанныеДокумента.Прочитать();
	
	Если НаборДанныеДокумента.Количество() = 0 Тогда
		ЗаписьНабора = НаборДанныеДокумента.Добавить();
	Иначе
		ЗаписьНабора = НаборДанныеДокумента[0];	
	КонецЕсли;
	
	ЗаписьНабора.Документ = Документ;
	ЗаписьНабора.Организация = Организация;
	ЗаписьНабора.ВидДокументаОбжалованияОтказаОПриемке = ВидДокументаОбжалованияОтказаОПриемке;
	ЗаписьНабора.РеквизитыДокументаОбжалованияОтказаОПриемке = РеквизитыДокументаОбжалованияОтказаОПриемке;
	
	НаборДанныеДокумента.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
